#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.rg: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
data.azurerm_resource_group.rg: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_user_assigned_identity.msi: Reading...
data.azurerm_container_registry.acr: Reading...
data.azurerm_key_vault.kv: Reading...
data.azurerm_container_app_environment.env: Reading...
data.azurerm_servicebus_namespace.sb: Reading...
data.azurerm_app_configuration.appconfig: Reading...
data.azurerm_application_insights.ai: Reading...
data.azurerm_application_insights.ai: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/components/ai-biotrackr-prod-ae]
data.azurerm_user_assigned_identity.msi: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
data.azurerm_key_vault.kv: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae]
data.azurerm_container_registry.acr: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
data.azurerm_container_app_environment.env: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]
data.azurerm_servicebus_namespace.sb: Read complete after 3s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae]
data.azurerm_app_configuration.appconfig: Read complete after 3s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app_job.job will be created
  + resource "azurerm_container_app_job" "job" {
      + container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + event_stream_endpoint        = (known after apply)
      + id                           = (known after apply)
      + location                     = "australiaeast"
      + name                         = "biotrackr-fitbitapi-svc"
      + outbound_ip_addresses        = (known after apply)
      + replica_retry_limit          = 3
      + replica_timeout_in_seconds   = 600
      + resource_group_name          = "rg-biotrackr-prod-ae"
      + tags                         = {
          + "Application" = "biotrackr"
          + "Component"   = "FitBitApi"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + registries (known after apply)

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + schedule_trigger_config {
          + cron_expression          = "0 5 * * *"
          + parallelism              = 1
          + replica_completion_count = 1
        }

      + secret (known after apply)

      + secrets (known after apply)

      + template {
          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-fitbitapi-svc:526eebf1bff36d454d9d75c3c787d2427788ac51"
              + memory            = "0.5Gi"
              + name              = "biotrackr-fitbitapi-svc"

              + env {
                  + name  = "keyvaulturl"
                  + value = "https://kv-biotrackr-prod-ae.vault.azure.net/"
                }
              + env {
                  + name  = "managedidentityclientid"
                  + value = "e0077542-1278-4f86-95e5-836782e55be2"
                }
              + env {
                  + name  = "servicebusendpoint"
                  + value = "https://sb-biotrackr-prod-ae.servicebus.windows.net:443/"
                }
              + env {
                  + name  = "azureappconfigendpoint"
                  + value = "https://appconfig-biotrackr-prod-ae.azconfig.io"
                }
              + env {
                  + name  = "appinsightsconnectionstring"
                  + value = (sensitive value)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*